cf/InformationRegisters/фмПараметры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>фмПараметры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеПараметра</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.фмЗначениеПараметра</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ИмяКомпьютера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОбластьПрименения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.фмОбластьПримененияПараметра</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяПараметра</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/InformationRegisters/фмПараметры/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Прочитать значение параметра.
//
// Параметры:
//  ИмяПараметра        - Строка - имя параметра.
//  ЗначениеПоУмолчанию - ОпределяемыйТип.фмЗначениеПараметра - значение по умолчанию.
//  ОбластьПрименения   - ОпределяемыйТип.фмОбластьПримененияПараметра - область применения параметра.
// 
// Возвращаемое значение:
//  ОпределяемыйТип.фмЗначениеПараметра - значение параметра.
//
Функция ПрочитатьЗначениеПараметра(Знач ИмяПараметра, Знач ЗначениеПоУмолчанию = Неопределено, Знач ОбластьПрименения = Неопределено) Экспорт
	
	Если ОбластьПрименения <> Неопределено Тогда
		ПараметрОбластьПрименения = ОбластьПрименения;
	Иначе
		ПараметрОбластьПрименения = фмПараметрыКлиентСерверПовтИсп.ТекущаяОбластьПримененияПараметра();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОбластьПрименения", ПараметрОбластьПрименения);
	Запрос.УстановитьПараметр("ИмяПараметра",  ИмяПараметра);
	Запрос.УстановитьПараметр("ИмяКомпьютера", ВРег(ИмяКомпьютера()));
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	фмПараметры.ЗначениеПараметра КАК ЗначениеПараметра
	               |ИЗ
	               |	РегистрСведений.фмПараметры КАК фмПараметры
	               |ГДЕ
	               |	фмПараметры.ИмяПараметра = &ИмяПараметра
	               |	И (фмПараметры.ОбластьПрименения = &ОбластьПрименения
	               |			ИЛИ фмПараметры.ОбластьПрименения = НЕОПРЕДЕЛЕНО)
	               |	И ВЫБОР
	               |			КОГДА фмПараметры.ИмяКомпьютера = """"
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ фмПараметры.ИмяКомпьютера ПОДОБНО ""%"" + &ИмяКомпьютера + ""%""
	               |		КОНЕЦ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	фмПараметры.ОбластьПрименения УБЫВ";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ЗначениеПараметра;
	КонецЕсли;
	
	Возврат ЗначениеПоУмолчанию;
	
КонецФункции

#КонецОбласти

#КонецЕсли
